# St7GetTHATemperatureLoadCase

Returns the load case that specifies the nodal temperature distribution for transient heat analysis.

long St7GetTHATemperatureLoadCase(long uID, long* CaseNum)
Input Parameters
uID
Strand7 model file ID.
Output Parameters
CaseNum
Load case number.